In [7]:
import pandas as pd

# Create a dictionary with three keys, 'A', 'B', and 'C', and lists of 10 numbers as values
data = {'A': list(range(10)),
        'B': list(range(10, 20)),
        'C': list(range(20, 30))}

# Convert the dictionary to a pandas DataFrame
df1 = pd.DataFrame(data)

# Print the DataFrame
df = df1.head()
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [8]:
df.size

15

In [9]:
df = pd.concat([df, pd.DataFrame([[None, None, None]], columns = df.columns)], ignore_index=True)

In [10]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     3    13    23
4     4    14    24
5  None  None  None

In [11]:
df.size

18

In [12]:
# size includes NULL

In [13]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({
    'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
    'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
    'C': ['small', 'large', 'large', 'small', 'small', 'large', 'small', 'small'],
    'D': [1, 2, 2, 3, 3, 4, 5, 6],
    'E': [2, 4, 5, 5, 6, 6, 8, 9]
})

# Groupby 'A' and 'B', then use size function
grouped = df.groupby(['A', 'B']).size()

grouped

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

In [14]:
# # size in group by is DIFFERENT from size in PANDAS 
# size() in groupby
# size in df